Revit 2024 API
DWFExportOptions.ImageFormat Property
Controls the compression level of images embedded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DWFImageFormat ImageFormat { get; set; }
Visual Basic
Public Property ImageFormat As DWFImageFormat
	Get
	Set
Visual C++
public:
property DWFImageFormat ImageFormat {
	DWFImageFormat get ();
	void set (DWFImageFormat value);
}
Remarks
ImageQuality is ignored when ImageFormat is set to "PNG"-the standard format.
See Also
DWFExportOptions Class
Autodesk.Revit.DB Namespace